# task 6

# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

a = 5
print(chr(a + 96))